Examinator/src/Catalogs/РесурсыСУЗ/РесурсыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РесурсыСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Общие</name>
      <description>Общие</description>
    </items>
    <items>
      <name>Служебные</name>
      <description>Служебные</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентичныйРесурс</name>
    <comment>Важно! Данный реквизит должен стоять перед реквизитом ФайлЗапуска, так как при экспорте необходимо сначала зарегистрировать идентичный ресурс, а потом файл, иначе ресурс будет экспортирован не полностью.</comment>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлЗапуска</name>
    <type>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыЗапуска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯкорьЗапуска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SCO</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Интерактивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключитьAPI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдинственныйФайл</name>
    <type>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/InformationRegisters/ЗначенияНастроекИнтерактивныхРесурсовСУЗ/ЗначенияНастроекИнтерактивныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияНастроекИнтерактивныхРесурсовСУЗ</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Представление</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>CatalogRef.НастройкиИнтерактивногоРесурсаСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДанныеФайлыСУЗ/ДанныеФайлыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеФайлыСУЗ</name>
  <resources>
    <name>ПрисоединенныйФайл</name>
    <type>
      <types>CatalogRef.ФайлыСУЗПрисоединенныеФайлы</types>
    </type>
  </resources>
  <resources>
    <name>ТекстовыеДанные</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДвоичныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеОбмена</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ТипыОбъектовСУЗ/ТипыОбъектовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбъектовСУЗ</name>
  <enumValues>
    <name>collection</name>
  </enumValues>
  <enumValues>
    <name>file</name>
  </enumValues>
  <enumValues>
    <name>frame</name>
  </enumValues>
  <enumValues>
    <name>glossary</name>
  </enumValues>
  <enumValues>
    <name>knowledgeBase</name>
  </enumValues>
  <enumValues>
    <name>map</name>
  </enumValues>
  <enumValues>
    <name>page</name>
  </enumValues>
  <enumValues>
    <name>question</name>
  </enumValues>
  <enumValues>
    <name>res</name>
  </enumValues>
  <enumValues>
    <name>term</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыФайловСУЗ/ТипыФайловСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыФайловСУЗ</name>
  <enumValues>
    <name>Default</name>
  </enumValues>
  <enumValues>
    <name>Folder</name>
  </enumValues>
  <enumValues>
    <name>Media</name>
  </enumValues>
  <enumValues>
    <name>Image</name>
  </enumValues>
  <enumValues>
    <name>Video</name>
  </enumValues>
  <enumValues>
    <name>Audio</name>
  </enumValues>
  <enumValues>
    <name>Document</name>
  </enumValues>
  <enumValues>
    <name>DataProcessor</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ВариантыЗагрузкиКартинокФайловСУЗ/ВариантыЗагрузкиКартинокФайловСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыЗагрузкиКартинокФайловСУЗ</name>
  <enumValues>
    <name>Стандартные</name>
  </enumValues>
  <enumValues>
    <name>Исходные</name>
  </enumValues>
  <enumValues>
    <name>УвеличиватьСтандартные</name>
  </enumValues>
  <enumValues>
    <name>УвеличиватьИсходные</name>
  </enumValues>
  <enumValues>
    <name>РасширятьСтандартные</name>
  </enumValues>
  <enumValues>
    <name>РасширятьИсходные</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ИспользуемыеПараметрыSCORM/ИспользуемыеПараметрыSCORM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИспользуемыеПараметрыSCORM</name>
  <enumValues>
    <name>completion_status</name>
  </enumValues>
  <enumValues>
    <name>progress_measure</name>
  </enumValues>
  <enumValues>
    <name>session_time</name>
  </enumValues>
  <enumValues>
    <name>exit</name>
  </enumValues>
  <enumValues>
    <name>success_status</name>
  </enumValues>
  <enumValues>
    <name>score</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/СессияЭлектронногоРесурсаСУЗ/СессияЭлектронногоРесурсаСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СессияЭлектронногоРесурсаСУЗ</name>
  <registerRecords>InformationRegister.ТестыНаПроверкуСУЗ</registerRecords>
  <registerRecords>InformationRegister.ОтветыНаВопросыСУЗ</registerRecords>
  <registerRecords>InformationRegister.ПрохожденияЭлектронныхРесурсовСУЗ</registerRecords>
  <registerRecords>InformationRegister.ВопросыТестированийСУЗ</registerRecords>
  <registerRecords>InformationRegister.ПовторноеПрохождениеЭлектронныхРесурсовСУЗ</registerRecords>
  <registerRecords>InformationRegister.ВыбранныеВариантыОтветовВопросовСУЗ</registerRecords>
  <registerRecords>InformationRegister.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскаяСессия</name>
    <type>
      <types>DocumentRef.СессияЭлектронногоРесурсаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСессии</name>
    <type>
      <types>EnumRef.ТипыСессийЭлектронныхРесурсовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТекстовые</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсторияИзменений</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Данные</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеТекстовые</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Catalogs/СводыЗнанийСУЗ/СводыЗнанийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СводыЗнанийСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>РуководствоПользователя</name>
      <description>Руководство пользователя</description>
    </items>
  </predefined>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартоваяСтраница</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочитатьПоставщика</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыЭлектронныхРесурсовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательнаяНавигация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьСодержание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Глоссарий</name>
    <type>
      <types>CatalogRef.ГлоссарииСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочнаяИнформация</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Базовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПервуюСсылкуНаТермин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТерминВсплывающейПодсказкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьНепройденное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПользовательскиеНастройки</name>
    <attributes>
      <name>ВидНастройки</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыНастроекЭлектронныхРесурсовСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыгружатьПриОткрытии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.ТерминыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/ЗависимыеРесурсыСУЗ/ЗависимыеРесурсыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗависимыеРесурсыСУЗ</name>
  <owners>Catalog.РесурсыСУЗ</owners>
  <attributes>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Модуль</name>
    <type>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Дополняет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополняетAPI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/РесурсыСУЗ/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	

#Область ПрограммныйИнтерфейс

// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ТипОбъектаСУЗ() Экспорт
	
	Возврат Перечисления.ТипыОбъектовСУЗ.res;
	
КонецФункции

// Позволяет получить XML данные объекта.
//
// Параметры
//  ОбъектСУЗ          - экземпляр обработки ОбъектСУЗ.
//  ПараметрыСсылки    – Структура, содержит параметры ссылки по которой вызывается вопрос.
//  КонтекстВыполнения - Структура, содержит параметры контекста выполнения объекта.
//
// Возвращаемое значение:
//   Строка – содержит XML представление объекта СУЗ.
//
Функция ПолучитьXMLПредставление(Ресурс, ПараметрыСсылки, КонтекстВыполнения) Экспорт
	
	РесурсXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Res","Ресурс");
	РесурсXDTO     = ФабрикаXDTO.Создать(РесурсXDTOТип);
	
	// Получаем параметры ресурса.
	
	ИмяОбъектаСУЗ = ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(ТипОбъектаСУЗ());
	
	РесурсXDTO.object        = ИмяОбъектаСУЗ;
	РесурсXDTO.Наименование  = Ресурс.Наименование;
	РесурсXDTO.SCO           = Ресурс.SCO;
	РесурсXDTO.id            = Ресурс.УникальныйИдентификатор();
	РесурсXDTO.РежимЭкспорта = ?(КонтекстВыполнения.ПараметрыЭкспорта = Неопределено, Ложь, Истина);
	
	ИдентификаторЭлементаСодержания = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "item");
	ИдентификаторСводаЗнаний        = Справочники.СводыЗнанийСУЗ.ИдентификаторКаталога(КонтекстВыполнения.ЭлементСодержания);
	
	ФайлXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Res","Файл");
	
	Если ЗначениеЗаполнено(Ресурс.ФайлЗапуска) Тогда
		
		// Если есть файл запуска, то размещаем только один файл запуска в ресурсе.
		// Остальные только кэшируем. При этом он будет запущен во фрейме, если ресурс
		// Запущен непосредственно. Если ресурс вставлен в подборку, то подборка определяет
		// Как запускать файл.
		
		ИмяЗапускаемогоОбъекта = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "object");
		
		Если ИмяЗапускаемогоОбъекта = "res" ИЛИ ИмяЗапускаемогоОбъекта = "knowledgeBase" Тогда
			
			ЗапускатьФайлВоФрейме = Истина;
			
			Если КонтекстВыполнения.Свойство("ЭлементСодержания")
				И ЗначениеЗаполнено(КонтекстВыполнения.ЭлементСодержания)
				И ЗначениеЗаполнено(КонтекстВыполнения.ЭлементСодержания.ПараметрыЗапуска) Тогда
				
				ПараметрыСсылки.Вставить("ПараметрыЗапуска", КонтекстВыполнения.ЭлементСодержания.ПараметрыЗапуска);
				
			КонецЕсли;
			
		Иначе
			
			Если КонтекстВыполнения.Свойство("ВозможноПоказатьОдинФайл") Тогда
				ЗапускатьФайлВоФрейме = КонтекстВыполнения.ВозможноПоказатьОдинФайл;
			Иначе
				ЗапускатьФайлВоФрейме = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
		КонтекстВыполнения.Вставить("ЗапускатьВоФрейме", ЗапускатьФайлВоФрейме);
		
		Если (НЕ ПараметрыСсылки.Свойство("ПараметрыСсылки") ИЛИ НЕ ЗначениеЗаполнено(ПараметрыСсылки.ПараметрыСсылки)) // Нет свойства, или оно не заполнено
			И ЗначениеЗаполнено(Ресурс.ПараметрыЗапуска) Тогда
			ПараметрыСсылки.Вставить("ПараметрыЗапуска", Ресурс.ПараметрыЗапуска);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ресурс.ЯкорьЗапуска) Тогда
			ПараметрыСсылки.Вставить("anchor", Ресурс.ЯкорьЗапуска);
		КонецЕсли;
		
		ФайлЗапуска = Ресурс.ФайлЗапуска;
		
		СтруктураДанныхФайла = ОбъектыСУЗ.ПолучитьПредставление(ФайлЗапуска, ПараметрыСсылки, КонтекстВыполнения);
		
		ФайлXDTO               = ФабрикаXDTO.Создать(ФайлXDTOТип);
		
		ФайлXDTO.Представление = СтруктураДанныхФайла.Представление;
		ФайлXDTO.Скрипт        = СтруктураДанныхФайла.Скрипт;
		ФайлXDTO.ЭтоГруппа     = Ложь;
		ФайлXDTO.Наименование  = ФайлЗапуска.Наименование;
		
		РесурсXDTO.Файл.Добавить(ФайлXDTO);
		
		
	Иначе
		
		ДеревоФайловРесурса = ДеревоФайлов(Ресурс, Ложь, КонтекстВыполнения.ПараметрыЭкспорта);
		
		Если КонтекстВыполнения.Свойство("ВозможноПоказатьОдинФайл") Тогда
			
			КоличествоФайлов = 0;
			КоличествоФайловРесурса(ДеревоФайловРесурса.Строки, КоличествоФайлов);
			
			Если КоличествоФайлов <> 1 Тогда
				КонтекстВыполнения.ВозможноПоказатьОдинФайл = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
		СформироватьXDTOФайлаРесурса(Ресурс, РесурсXDTO, ДеревоФайловРесурса.Строки, ПараметрыСсылки, КонтекстВыполнения);
		
	КонецЕсли;
	
	Если Ресурс.Интерактивный Тогда
		
		// Получаем настройки интерактивного ресурса
		
		РесурсXDTO.НастройкиИнтерактивногоРесурса = РегистрыСведений.ЗначенияНастроекИнтерактивныхРесурсовСУЗ.ПолучитьJSСтрокуНастроекРесурса(Ресурс);

	КонецЕсли;
	
	// Формируем XML
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, РесурсXDTO);
	XMLДанные = ЗаписьXML.Закрыть();
	
	// Указываем шаблоны
	
	ШаблонОбъекта = ОбъектыСУЗ.ПолучитьСсылкуНаXSLШаблонОбъекта(Ресурс);
	ОбъектыСУЗ.ДобавитьШаблонВСписокОбъекта(ШаблонОбъекта, КонтекстВыполнения.СписокШаблонов);
	
	// Указываем зависимые ресурсы и модули
	
	ТаблицаЗависимыхРесурсов = ОбъектыСУЗ.ТаблицаЗависимыхРесурсов(Ресурс);
	
	ОбъектыСУЗ.ДобавитьРесурсВМассивРесурсов(Ресурс, КонтекстВыполнения.СписокРесурсов,,ТаблицаЗависимыхРесурсов);
	
	ОбъектыСУЗ.ДобавитьМодулиРесурса(Ресурс, КонтекстВыполнения.СписокМодулей, ТаблицаЗависимыхРесурсов);
	
	ОбъектыСУЗ.ДобавитьСсылкиОбъектаВМассив(Ресурс, КонтекстВыполнения);	
	
	// Завершаем
	
	Возврат XMLДанные;
		
КонецФункции

Функция ДеревоФайлов(Ресурс, ВключитьЗависимые = Истина, ПараметрыЭкспорта = Неопределено) Экспорт
	 
	// Делаем проверки
	//
	
	Если ЗначениеЗаполнено(Ресурс.ИдентичныйРесурс) Тогда
		// Если указан идентичный ресурс, то берем файлы из него.
		Возврат ДеревоФайлов(Ресурс.ИдентичныйРесурс, ВключитьЗависимые, ПараметрыЭкспорта);
	КонецЕсли;
	
	// Выбираем все файлы ресурса и все файлы зависимых ресурсов.
	//
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ФайлыСУЗ.Ссылка КАК Ссылка,
	               |	ФайлыСУЗ.ИмяФайла КАК ИмяФайла,
	               |	ФайлыСУЗ.ЭтоГруппа КАК ЭтоГруппа,
	               |	ФайлыСУЗ.Наименование КАК Наименование,
	               |	ФайлыСУЗ.Скрывать КАК Скрывать,
	               |	ФайлыСУЗ.Владелец КАК Владелец,
	               |	ФайлыСУЗ.ТипФайла КАК ТипФайла,
				   |	ФайлыСУЗ.ВнешнийФайл КАК ВнешнийФайл,
	               |	ФайлыСУЗ.ДатаИзменения КАК ДатаИзменения,
	               |	ВЫБОР
	               |		КОГДА ФайлыСУЗ.ЭтоГруппа
	               |			ТОГДА 2
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Картинка
	               |ИЗ
	               |	Справочник.ФайлыСУЗ КАК ФайлыСУЗ
	               |ГДЕ
	               |	ФайлыСУЗ.ПометкаУдаления = ЛОЖЬ
	               |	И ФайлыСУЗ.Владелец = &Ресурс";
				   
				   
	Если ВключитьЗависимые И НЕ Ресурс.Интерактивный Тогда
				   
		ТекстЗапроса = ТекстЗапроса + "
				   |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	ФайлыСУЗ.Ссылка,
	               |	ФайлыСУЗ.ИмяФайла,
	               |	ФайлыСУЗ.ЭтоГруппа,
	               |	ФайлыСУЗ.Наименование,
	               |	ФайлыСУЗ.Скрывать,
	               |	ФайлыСУЗ.Владелец,
	               |	ФайлыСУЗ.ТипФайла,
				   |	ФайлыСУЗ.ВнешнийФайл,
	               |	ФайлыСУЗ.ДатаИзменения,
	               |	ВЫБОР
	               |		КОГДА ФайлыСУЗ.ЭтоГруппа
	               |			ТОГДА 2
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Картинка
	               |ИЗ
	               |	Справочник.ФайлыСУЗ КАК ФайлыСУЗ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗависимыеРесурсыСУЗ КАК ЗависимыеРесурсыСУЗ
	               |		ПО ФайлыСУЗ.Владелец = ЗависимыеРесурсыСУЗ.Ресурс
	               |ГДЕ
	               |	ЗависимыеРесурсыСУЗ.Владелец = &Ресурс
				   |    И ЗависимыеРесурсыСУЗ.Дополняет = ИСТИНА
	               |	И ЗависимыеРесурсыСУЗ.ПометкаУдаления = ЛОЖЬ
				   |	И ФайлыСУЗ.ПометкаУдаления = ЛОЖЬ";
				   
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Наименование ИЕРАРХИЯ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ресурс", Ресурс);
	
	ВыборкаВсехФайловРесурса = Запрос.Выполнить();
	ДеревоФайловРесурса      = ВыборкаВсехФайловРесурса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ПодготовитьДеревоФайловДляПубликации(ДеревоФайловРесурса.Строки, ПараметрыЭкспорта);
	
	// Добавляем в дерево виртуальные файлы с api для внешнего файла
	//
	
	Если (Ресурс.ПодключитьAPI) И ЗначениеЗаполнено(Ресурс.ФайлЗапуска) Тогда
		
		// Ищем в дереве файл запуска
		
		ФайлЗапускаСтрока = ДеревоФайловРесурса.Строки.Найти(Ресурс.ФайлЗапуска, "Ссылка", Истина);
		
		Если ФайлЗапускаСтрока <> Неопределено Тогда
			
			// Находим родителя строки файла запуска
			
			Если ФайлЗапускаСтрока.Родитель = Неопределено Тогда
				СтрокиРодителя = ДеревоФайловРесурса.Строки;
			Иначе
				СтрокиРодителя = ФайлЗапускаСтрока.Родитель.Строки;
			КонецЕсли;
			
			// Файл, в котором подключаются стандартные скрипты, нужные для работы API
			
			НоваяСтрока = СтрокиРодителя.Добавить();
			
			Для каждого Колонка Из ДеревоФайловРесурса.Колонки Цикл
				НоваяСтрока[Колонка.Имя] = ФайлЗапускаСтрока[Колонка.Имя];	
			КонецЦикла;
			
			НоваяСтрока.ИмяФайла     = "page_scripts.js";
			НоваяСтрока.Наименование = "API SCRIPTS";
			НоваяСтрока.Скрывать     = Истина;
			НоваяСтрока.Ссылка       = Неопределено;
			НоваяСтрока.ВнешнийФайл  = Ложь;
			НоваяСтрока.ТипФайла     = Перечисления.ТипыФайловСУЗ.Default;
			НоваяСтрока.ЭтоГруппа    = Ложь;
					
		КонецЕсли;
		
	КонецЕсли;
	
	// Завершаем
	//
	
	Возврат ДеревоФайловРесурса;
	
КонецФункции

Функция ВыборкаФайлов(Ресурс) Экспорт
	
	// Примечение: если используется для публикации, то не забыть изменять имя файла.
	// В функции это не делается. Аналогично для видео файлов. 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФайлыСУЗ.Ссылка,
		|	ФайлыСУЗ.Родитель,
		|	ФайлыСУЗ.ЭтоГруппа,
		|	ФайлыСУЗ.Наименование,
		|	ФайлыСУЗ.ТипФайла,
		|	ФайлыСУЗ.ИмяФайла,
		|	ФайлыСУЗ.ДатаИзменения
		|ИЗ
		|	Справочник.ФайлыСУЗ КАК ФайлыСУЗ
		|ГДЕ
		|	ФайлыСУЗ.Владелец = &Ресурс";

	Запрос.Параметры.Вставить("Ресурс", Ресурс);
		
	Результат = Запрос.Выполнить();

	Возврат Результат.Выбрать();
	
КонецФункции

Функция СтруктураФайловРесурса(Ресурс, СтрокиДереваФайлов, Знач УровеньВложенности, ЭлектронныйРесурс, ПоставщикСводаЗнаний, ПараметрыЭкспорта = Неопределено, Знач КонтекстВыполнения = Неопределено) Экспорт
	
	Если СтрокиДереваФайлов.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	МассивФайлов = Новый Массив();
	
	ФайлыДляУдаления = Новый Массив;
	
	Для каждого Строка Из СтрокиДереваФайлов Цикл
	
		Файл = Новый Структура;
		
		Файл.Вставить("ИмяФайла", Строка.ИмяФайла);
		Файл.Вставить("ЭтоКаталог", Строка.ЭтоГруппа);
		Файл.Вставить("ДвоичныеДанные", Неопределено);
		Файл.Вставить("ПодчиненныеФайлы", Неопределено);
		Файл.Вставить("ТипФайла", Неопределено);
		
		Если Строка.ЭтоГруппа Тогда
			
			МассивФайловРесурса = СтруктураФайловРесурса(Ресурс, Строка.Строки, УровеньВложенности + 1, ЭлектронныйРесурс, ПоставщикСводаЗнаний, ПараметрыЭкспорта, КонтекстВыполнения); // Рекурсивный вызов.
			Файл.Вставить("ПодчиненныеФайлы", МассивФайловРесурса);
			
		Иначе
			
			Если Строка.ТипФайла = Перечисления.ТипыФайловСУЗ.Document Тогда
				УровеньВложенности = УровеньВложенности + 1;
			КонецЕсли;			
			
			Если Строка.ИмяФайла = "page_scripts.js" Тогда
				
				ДвоичныеДанные = ДвоичныеДанныеФайлаСкриптовAPIДляЗагруженныхФайлов(Строка.Владелец, ЭлектронныйРесурс, УровеньВложенности, ПараметрыЭкспорта, КонтекстВыполнения);
				
			Иначе
				
				КодДанных = "ДвоичныеДанные";
				
				Если Строка.ТипФайла = Перечисления.ТипыФайловСУЗ.Video Тогда
					
					ТекущийФормат = Справочники.ФайлыСУЗ.БазовыйФорматВидеоФайла(Строка.ИмяФайла); // Формат, который надо показать				
					ДопФорматыФайла = РазработкаСУЗПовтИсп.ДополнительныеФорматыВидео(Строка.Ссылка);
						
					Если ДопФорматыФайла.Найти(ТекущийФормат, "Формат") <> Неопределено Тогда						
						КодДанных = ТекущийФормат; // Берем сконвертированный формат, так как он есть в регистре						
					КонецЕсли;						
					
					Если Справочники.ФайлыСУЗ.ЕстьМиниатюра(Строка.Ссылка) Тогда
						
						// Добавляем виртуальный файл миниатюры файла видео
						
						ФайлМиниатюры = Новый Структура;
							
						ФайлМиниатюры.Вставить("ИмяФайла", Справочники.ФайлыСУЗ.ИмяФайлаМиниатюры(Строка.ИмяФайла));
						ФайлМиниатюры.Вставить("ЭтоКаталог", Ложь);
						ФайлМиниатюры.Вставить("ДвоичныеДанные", ОбъектыСУЗ.ПолучитьДанные(Строка.Ссылка, "Миниатюра", Истина, "ДвоичныеДанные", ПоставщикСводаЗнаний));
						ФайлМиниатюры.Вставить("ПодчиненныеФайлы", Неопределено);
						ФайлМиниатюры.Вставить("ТипФайла", ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(Перечисления.ТипыФайловСУЗ.Image));
						
						МассивФайлов.Добавить(ФайлМиниатюры);
												
					КонецЕсли;
					
				КонецЕсли;
				
				Если Строка.ТипФайла = Перечисления.ТипыФайловСУЗ.Document Тогда
					КодДанных = "HTML";
				КонецЕсли;				
				
				ДвоичныеДанные = Неопределено;
				Если НЕ Строка.ВнешнийФайл Тогда
					ДвоичныеДанные = ОбъектыСУЗ.ПолучитьДанные(Строка.Ссылка, КодДанных, Истина, "ДвоичныеДанные", ПоставщикСводаЗнаний);
				КонецЕсли;
					
				РеквизитыРесурса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ресурс, "ФайлЗапуска, ПодключитьAPI");
				
				РасширениеФайла = НРег(ОбщегоНазначенияСУКлиентСервер.РасширениеИмениФайла(Строка.ИмяФайла));
				
				Если (РеквизитыРесурса.ПодключитьAPI 
					И РеквизитыРесурса.ФайлЗапуска = Строка.Ссылка 
					И ДвоичныеДанные <> Неопределено
					И (РасширениеФайла = "html" ИЛИ РасширениеФайла = "htm")) 
					ИЛИ Строка.ТипФайла = Перечисления.ТипыФайловСУЗ.Document Тогда
					
					Если Строка.ТипФайла = Перечисления.ТипыФайловСУЗ.Document Тогда
						
						ПутьКАрхивуДокумента = ПолучитьИмяВременногоФайла("zip");
						
						ДвоичныеДанные.Записать(ПутьКАрхивуДокумента);
						
						ФайлыДляУдаления.Добавить(ПутьКАрхивуДокумента);
						
						ПутьККаталогуДокумента = ПолучитьИмяВременногоФайла("");
						СоздатьКаталог(ПутьККаталогуДокумента);
						
						ФайлыДляУдаления.Добавить(ПутьККаталогуДокумента);
						
						ФайлАрхива = Новый ЧтениеZIPФайла(ПутьКАрхивуДокумента);
						ФайлАрхива.ИзвлечьВсе(ПутьККаталогуДокумента, РежимВосстановленияПутейФайловZIP.Восстанавливать); 
						ФайлАрхива.Закрыть(); 				
						
						ПутьККаталогуДокумента = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуДокумента);
						
						ПолныйПутьКФайлу = РазработкаСУЗКлиентСервер.ПутьКФайлуЗапускаДокумента(ПутьККаталогуДокумента);
						
					Иначе
						
						ПолныйПутьКФайлу = ПолучитьИмяВременногоФайла(РасширениеФайла);
					
						ДвоичныеДанные.Записать(ПолныйПутьКФайлу);						
						
						ФайлыДляУдаления.Добавить(ПолныйПутьКФайлу);
						
					КонецЕсли;
					
					// Изменяем файл страницы HTML
					//
					
					ЧтениеHTML = Новый ЧтениеHTML;
					ЧтениеHTML.ОткрытьФайл(ПолныйПутьКФайлу);
					
					ПостроительDOM = Новый ПостроительDOM;
					ДокументHTML = ПостроительDOM.Прочитать(ЧтениеHTML);
					
					// Устанавливаем id для видеороликов
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ РАЗЛИЧНЫЕ
						|	ЗависимыеРесурсыСУЗ.Ресурс КАК Ресурс
						|ИЗ
						|	Справочник.ЗависимыеРесурсыСУЗ КАК ЗависимыеРесурсыСУЗ
						|ГДЕ
						|	ЗависимыеРесурсыСУЗ.ПометкаУдаления = ЛОЖЬ
						|	И ЗависимыеРесурсыСУЗ.Владелец = &Ресурс
						|	И ЗависимыеРесурсыСУЗ.ДополняетAPI = ИСТИНА";

					Запрос.УстановитьПараметр("Ресурс", Ресурс);

					Результат = Запрос.Выполнить();

					ВыборкаДетальныеЗаписи = Результат.Выбрать();

					НомерРесурса = 1;
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

						ИдентификаторРесурса = Строка(ВыборкаДетальныеЗаписи.Ресурс.УникальныйИдентификатор());
						
						Для каждого ЭлементHTML Из ДокументHTML.Якоря Цикл
							
							Если ЭлементHTML.ТекстовоеСодержимое = "{{"+ИдентификаторРесурса+"}}" Тогда
								
								НовыйАтрибут = ДокументHTML.СоздатьАтрибут("style");
								НовыйАтрибут.Значение = "display: none;";
								ЭлементHTML.Атрибуты.УстановитьИменованныйЭлемент(НовыйАтрибут);
								
								ЭлементHTML.Идентификатор = "res_" + СтрЗаменить(ИдентификаторРесурса, "-", "") + "_" + ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(НомерРесурса);
								
								НовыйАтрибут = ДокументHTML.СоздатьАтрибут("idObject");
								НовыйАтрибут.Значение = ИдентификаторРесурса;
								ЭлементHTML.Атрибуты.УстановитьИменованныйЭлемент(НовыйАтрибут);
								
								НовыйАтрибут = ДокументHTML.СоздатьАтрибут("typeObject");
								НовыйАтрибут.Значение = "res";
								ЭлементHTML.Атрибуты.УстановитьИменованныйЭлемент(НовыйАтрибут);
								
							КонецЕсли;
							
						КонецЦикла;	
						
						НомерРесурса = НомерРесурса + 1;
						
					КонецЦикла;
					
					// Добавляем скрипты
					
					ЭлементыHEAD = ДокументHTML.ПолучитьЭлементыПоИмени("head");
					
					Если ЭлементыHEAD.Количество() > 0 Тогда
						
						ЭлементHEAD	= ЭлементыHEAD[0];
						
						ЭлементМЕТА =  ДокументHTML.СоздатьЭлемент("meta");
						
						НовыйАтрибут = ДокументHTML.СоздатьАтрибут("name");
						НовыйАтрибут.Значение = "viewport";
						ЭлементМЕТА.Атрибуты.УстановитьИменованныйЭлемент(НовыйАтрибут);

						НовыйАтрибут = ДокументHTML.СоздатьАтрибут("content");
						НовыйАтрибут.Значение = "width=device-width, initial-scale=1";
						ЭлементМЕТА.Атрибуты.УстановитьИменованныйЭлемент(НовыйАтрибут);
						
						ЭлементHEAD.ДобавитьДочерний(ЭлементМЕТА);
						
						ПутьККаталогуРесурсов = ОбъектыСУЗКлиентСервер.ПолучитьПутьККаталогуРесурсовОтносительноФайла(УровеньВложенности);
						
						Если ПараметрыЭкспорта = Неопределено Тогда
							
							ПутьККаталогуРесурсов = ПутьККаталогуРесурсов;
							
							ОбщегоНазначенияСУ.СоздатьЭлементСтилейВHTMLДокументе(ЭлементHEAD, ДокументHTML, ПутьККаталогуРесурсов + "js/jquery/plugins/lightbox/lightbox.css");
							
							ОбщегоНазначенияСУ.СоздатьЭлементСкриптаВHTMLДокументе(ЭлементHEAD, ДокументHTML, ПутьККаталогуРесурсов + "js/jquery/jquery.js"); 
							
							ОбщегоНазначенияСУ.СоздатьЭлементСкриптаВHTMLДокументе(ЭлементHEAD, ДокументHTML, ПутьККаталогуРесурсов + "js/swfobject.js"); 
							ОбщегоНазначенияСУ.СоздатьЭлементСкриптаВHTMLДокументе(ЭлементHEAD, ДокументHTML, ПутьККаталогуРесурсов + "js/swfformfix.js"); 
							
							ОбщегоНазначенияСУ.СоздатьЭлементСкриптаВHTMLДокументе(ЭлементHEAD, ДокументHTML, ПутьККаталогуРесурсов + "js/jquery/plugins/media/jquery.media.js"); 
							ОбщегоНазначенияСУ.СоздатьЭлементСкриптаВHTMLДокументе(ЭлементHEAD, ДокументHTML, ПутьККаталогуРесурсов + "js/jquery/plugins/lightbox/lightbox_custom.js"); 
							
							ОбщегоНазначенияСУ.СоздатьЭлементСкриптаВHTMLДокументе(ЭлементHEAD, ДокументHTML, ПутьККаталогуРесурсов + "js/page_api.js"); 
							
							ОбщегоНазначенияСУ.СоздатьЭлементСтилейВHTMLДокументе(ЭлементHEAD, ДокументHTML, ПутьККаталогуРесурсов + "plugins/qtip2/jquery.qtip.css");
							ОбщегоНазначенияСУ.СоздатьЭлементСкриптаВHTMLДокументе(ЭлементHEAD, ДокументHTML, ПутьККаталогуРесурсов + "plugins/qtip2/jquery.qtip.js");
							
							
						Иначе
							
							Если ПараметрыЭкспорта.ДляТестирования Тогда
								
								ОбщегоНазначенияСУ.СоздатьЭлементСкриптаВHTMLДокументе(ЭлементHEAD, ДокументHTML, ПутьККаталогуРесурсов + "../app/common/jquery/jquery.js");
								ОбщегоНазначенияСУ.СоздатьЭлементСкриптаВHTMLДокументе(ЭлементHEAD, ДокументHTML, ПутьККаталогуРесурсов + "../app/common/jquery/jquery.browser.js");
								ОбщегоНазначенияСУ.СоздатьЭлементСкриптаВHTMLДокументе(ЭлементHEAD, ДокументHTML, ПутьККаталогуРесурсов + "../app/common/postmessage.js");
								ОбщегоНазначенияСУ.СоздатьЭлементСкриптаВHTMLДокументе(ЭлементHEAD, ДокументHTML, ПутьККаталогуРесурсов + "../app/common/common.js");
								ОбщегоНазначенияСУ.СоздатьЭлементСкриптаВHTMLДокументе(ЭлементHEAD, ДокументHTML, ПутьККаталогуРесурсов + "../app/common/mobile.js");
								
								ОбщегоНазначенияСУ.СоздатьЭлементСкриптаВHTMLДокументе(ЭлементHEAD, ДокументHTML, ПутьККаталогуРесурсов + "js/libs/swfobject.js");
								ОбщегоНазначенияСУ.СоздатьЭлементСкриптаВHTMLДокументе(ЭлементHEAD, ДокументHTML, ПутьККаталогуРесурсов + "js/libs/swfformfix.js");
								ОбщегоНазначенияСУ.СоздатьЭлементСкриптаВHTMLДокументе(ЭлементHEAD, ДокументHTML, ПутьККаталогуРесурсов + "js/libs/jquery.mark.js");
								
							Иначе
								
								ОбщегоНазначенияСУ.СоздатьЭлементСкриптаВHTMLДокументе(ЭлементHEAD, ДокументHTML, ПутьККаталогуРесурсов + "../app/common/js/common.js"); //jQuery и postmassege
								ОбщегоНазначенияСУ.СоздатьЭлементСкриптаВHTMLДокументе(ЭлементHEAD, ДокументHTML, ПутьККаталогуРесурсов + "js/libs.js"); //swfformfix.js и swfobject.js (остальные не нужны)
								
							КонецЕсли;
							
							ОбщегоНазначенияСУ.СоздатьЭлементСтилейВHTMLДокументе(ЭлементHEAD, ДокументHTML, ПутьККаталогуРесурсов + "components/swipebox/css/swipebox.css");
							ОбщегоНазначенияСУ.СоздатьЭлементСкриптаВHTMLДокументе(ЭлементHEAD, ДокументHTML, ПутьККаталогуРесурсов + "components/swipebox/js/jquery.swipebox.js");
							ОбщегоНазначенияСУ.СоздатьЭлементСкриптаВHTMLДокументе(ЭлементHEAD, ДокументHTML, ПутьККаталогуРесурсов + "components/swipebox/js/ios-orientationchange-fix.js");
							
							ОбщегоНазначенияСУ.СоздатьЭлементСкриптаВHTMLДокументе(ЭлементHEAD, ДокументHTML, ПутьККаталогуРесурсов + "components/page_api.js");
							
							ОбщегоНазначенияСУ.СоздатьЭлементСтилейВHTMLДокументе(ЭлементHEAD, ДокументHTML, ПутьККаталогуРесурсов + "plugins/qtip2/jquery.qtip.css");
							ОбщегоНазначенияСУ.СоздатьЭлементСкриптаВHTMLДокументе(ЭлементHEAD, ДокументHTML, ПутьККаталогуРесурсов + "plugins/qtip2/jquery.qtip.js");
							
						КонецЕсли;	
						
						Если Строка.ТипФайла = Перечисления.ТипыФайловСУЗ.Document
							ИЛИ Строка.ТипФайла = Перечисления.ТипыФайловСУЗ.Folder Тогда
							
							// Файлы располагаются в каталоге, поэтому ищем файл со скриптами на уровне выше
							
							ОбщегоНазначенияСУ.СоздатьЭлементСкриптаВHTMLДокументе(ЭлементHEAD, ДокументHTML, "../page_scripts.js"); 
							
						Иначе
							
							ОбщегоНазначенияСУ.СоздатьЭлементСкриптаВHTMLДокументе(ЭлементHEAD, ДокументHTML, "page_scripts.js"); 
							
						КонецЕсли;
						
						ОбщегоНазначенияСУ.СоздатьЭлементСкриптаВHTMLДокументе(ЭлементHEAD, ДокументHTML, ПутьККаталогуРесурсов + "../../../res.js"); 						
											
					КонецЕсли;
						
					// Заменяем картинки
					
					ОписаниеФайла = ОбъектыСУЗ.ПолучитьДанные(Строка.Ссылка, "Описание", Истина,, ПоставщикСводаЗнаний);
					
					НачалоСекцииОписанияКартинок = Найти(ОписаниеФайла, "{{IMAGES>");
					КонецСекцииОписанияКартинок  = Найти(ОписаниеФайла, "<IMAGES}}");
					
					Если НачалоСекцииОписанияКартинок > 0 И КонецСекцииОписанияКартинок Тогда
						
						ЧтениеXML = Новый ЧтениеXML;
						ЧтениеXML.УстановитьСтроку(СокрЛП(Сред(ОписаниеФайла, НачалоСекцииОписанияКартинок + 10, КонецСекцииОписанияКартинок-11)));
						
						КартинкиXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/ImportFilesSettings", "Картинки");
						КартинкиXDTO    = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, КартинкиXDTOТип);
						
						Если КартинкиXDTO.ВариантЗагрузкиКартинок <> Перечисления.ВариантыЗагрузкиКартинокФайловСУЗ.Стандартные Тогда
						
							Для каждого КартинкаDOM Из ДокументHTML.Картинки Цикл
								
								КартинкаКакФайл = Новый Файл(КартинкаDOM.Источник);
								ИмяСерии        = КартинкаКакФайл.ИмяБезРасширения;
								
								КартинкиСерииXDTO = Неопределено;
								
								Для каждого СтрокаXDTO Из КартинкиXDTO.СерияКартинок Цикл
								
									Если СтрокаXDTO.Имя = ИмяСерии Тогда
										КартинкиСерииXDTO = СтрокаXDTO.Картинка;	
										Прервать;
									КонецЕсли;
								
								КонецЦикла;
								
								Если КартинкиСерииXDTO = Неопределено Тогда
									Продолжить;
								КонецЕсли;
								
								ИмяИсходногоФайла = Неопределено;
								
								Для каждого КартинкаXDTO Из КартинкиСерииXDTO Цикл
									Если КартинкаXDTO.Имя <> КартинкаКакФайл.Имя Тогда
										// Исходный файл только один и не равен стандартному
										ИмяИсходногоФайла = КартинкаXDTO.Имя;
										Прервать;
									КонецЕсли;
                                КонецЦикла;
								
								Если ИмяИсходногоФайла = Неопределено Тогда
									Продолжить;
								КонецЕсли;
								
								Если КартинкиXDTO.ВариантЗагрузкиКартинок = Перечисления.ВариантыЗагрузкиКартинокФайловСУЗ.Исходные Тогда
								
									КартинкаDOM.Источник = СтрЗаменить(КартинкаDOM.Источник, КартинкаКакФайл.Имя, ИмяИсходногоФайла);
									КартинкаDOM.Ширина = КартинкаXDTO.Ширина;
									КартинкаDOM.Высота = КартинкаXDTO.Высота;
									
									Продолжить;
									
								КонецЕсли;
								
								Если КартинкиXDTO.ВариантЗагрузкиКартинок = Перечисления.ВариантыЗагрузкиКартинокФайловСУЗ.УвеличиватьСтандартные
									ИЛИ КартинкиXDTO.ВариантЗагрузкиКартинок = Перечисления.ВариантыЗагрузкиКартинокФайловСУЗ.УвеличиватьИсходные
									ИЛИ КартинкиXDTO.ВариантЗагрузкиКартинок = Перечисления.ВариантыЗагрузкиКартинокФайловСУЗ.РасширятьИсходные
									ИЛИ КартинкиXDTO.ВариантЗагрузкиКартинок = Перечисления.ВариантыЗагрузкиКартинокФайловСУЗ.РасширятьСтандартные Тогда
									
									Если НЕ ЭлементHTMLЯвляетсяСсылкой(КартинкаDOM) Тогда
										
										НовыйАтрибут = ДокументHTML.СоздатьАтрибут("srcSource");
										НовыйАтрибут.Значение = СтрЗаменить(КартинкаDOM.Источник, КартинкаКакФайл.Имя, ИмяИсходногоФайла);
										
										КартинкаDOM.Атрибуты.УстановитьИменованныйЭлемент(НовыйАтрибут);
										
										
										НовыйАтрибут = ДокументHTML.СоздатьАтрибут("srcStandard");
										НовыйАтрибут.Значение = КартинкаDOM.Источник;
										
										КартинкаDOM.Атрибуты.УстановитьИменованныйЭлемент(НовыйАтрибут);
										
										
										НовыйАтрибут = ДокументHTML.СоздатьАтрибут("widthSource");
										НовыйАтрибут.Значение = ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(КартинкаXDTO.Ширина);
										
										КартинкаDOM.Атрибуты.УстановитьИменованныйЭлемент(НовыйАтрибут);
										
										
										НовыйАтрибут = ДокументHTML.СоздатьАтрибут("heightSource");
										НовыйАтрибут.Значение = ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(КартинкаXDTO.Высота);
										
										КартинкаDOM.Атрибуты.УстановитьИменованныйЭлемент(НовыйАтрибут);
										
										
										НовыйАтрибут = ДокументHTML.СоздатьАтрибут("widthStandard");
										НовыйАтрибут.Значение = ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(КартинкаDOM.Ширина);
										
										КартинкаDOM.Атрибуты.УстановитьИменованныйЭлемент(НовыйАтрибут);
										
										
										НовыйАтрибут = ДокументHTML.СоздатьАтрибут("heightStandard");
										НовыйАтрибут.Значение = ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(КартинкаDOM.Высота);
										
										КартинкаDOM.Атрибуты.УстановитьИменованныйЭлемент(НовыйАтрибут);
										
										
										НовыйАтрибут = ДокументHTML.СоздатьАтрибут("typeZoom");
										
										
										Если КартинкиXDTO.ВариантЗагрузкиКартинок = Перечисления.ВариантыЗагрузкиКартинокФайловСУЗ.УвеличиватьСтандартные
											ИЛИ КартинкиXDTO.ВариантЗагрузкиКартинок = Перечисления.ВариантыЗагрузкиКартинокФайловСУЗ.УвеличиватьИсходные Тогда
											
											НовыйАтрибут.Значение = "lightbox";
											
										Иначе
											
											Если КартинкиXDTO.ВариантЗагрузкиКартинок = Перечисления.ВариантыЗагрузкиКартинокФайловСУЗ.РасширятьИсходные Тогда
												НовыйАтрибут.Значение = "increaseSource";
											Иначе
												НовыйАтрибут.Значение = "increaseStandard";
											КонецЕсли;
											
										КонецЕсли;
										
										КартинкаDOM.Атрибуты.УстановитьИменованныйЭлемент(НовыйАтрибут);
										
										
										Если КартинкиXDTO.ВариантЗагрузкиКартинок = Перечисления.ВариантыЗагрузкиКартинокФайловСУЗ.УвеличиватьИсходные
											ИЛИ КартинкиXDTO.ВариантЗагрузкиКартинок = Перечисления.ВариантыЗагрузкиКартинокФайловСУЗ.РасширятьИсходные Тогда
											
											КартинкаDOM.Источник = СтрЗаменить(КартинкаDOM.Источник, КартинкаКакФайл.Имя, ИмяИсходногоФайла);
											
										КонецЕсли;
											
									КонецЕсли;
									
									Продолжить;
									
								КонецЕсли;
								
							КонецЦикла;
						
						КонецЕсли;
					
					КонецЕсли; // Заменяем картинки
					
					// Завершаем изменение HTML
					
					ЧтениеHTML.Закрыть();
					
					ЗаписьHTML = Новый ЗаписьHTML;
					ЗаписьHTML.ОткрытьФайл(ПолныйПутьКФайлу);
					
					ЗаписьDOM = Новый ЗаписьDOM;
					ЗаписьDOM.Записать(ДокументHTML, ЗаписьHTML);
					
					ЗаписьHTML.Закрыть();

					// Формируем список терминов для замены
					//
					
					Если ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
					
						ДанныеЭлектронногоРесурса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлектронныйРесурс, "Глоссарий, ПоказыватьПервуюСсылкуНаТермин, ПоказыватьТерминВсплывающейПодсказкой");
						
						Если ЗначениеЗаполнено(ДанныеЭлектронногоРесурса.Глоссарий) Тогда
							
							СтраницаТекстовыйДокумент = Новый ТекстовыйДокумент;
							СтраницаТекстовыйДокумент.Прочитать(ПолныйПутьКФайлу, "UTF-8");
							
							ТекстСтраницы   = СтраницаТекстовыйДокумент.ПолучитьТекст();
							ТаблицаТерминов = Справочники.ГлоссарииСУЗ.Термины(ДанныеЭлектронногоРесурса.Глоссарий, Истина);
							
							МассивОпределений = Новый Массив();
							
							Для каждого Термин Из ТаблицаТерминов Цикл
								ТекстСтраницы = ОбъектыСУЗ.ЗаменитьТермин(ТекстСтраницы, Термин, ДанныеЭлектронногоРесурса.ПоказыватьПервуюСсылкуНаТермин, ДанныеЭлектронногоРесурса.ПоказыватьТерминВсплывающейПодсказкой,, МассивОпределений, Истина);
							КонецЦикла;
							
							СтраницаТекстовыйДокумент.УстановитьТекст(ТекстСтраницы);
							СтраницаТекстовыйДокумент.Записать(ПолныйПутьКФайлу, "UTF-8");

						КонецЕсли;
						
					КонецЕсли;

					Если Строка.ТипФайла = Перечисления.ТипыФайловСУЗ.Document Тогда
						
						ПутьКАрхивуZIP = ПолучитьИмяВременногоФайла("zip");
						
						ФайлZIP = Новый ЗаписьZipФайла(ПутьКАрхивуZIP);							
						ФайлZIP.Добавить(ПутьККаталогуДокумента + "*", РежимСохраненияПутейZIP.СохранятьОтносительныеПути,  РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
						ФайлZIP.Записать();		

						ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКАрхивуZIP);
						
					Иначе
						
						ДвоичныеДанные = Новый ДвоичныеДанные(ПолныйПутьКФайлу);
						
					КонецЕсли;
					
				КонецЕсли; //ПодключитьAPI
				
			КонецЕсли;
			
			Файл.Вставить("ДвоичныеДанные", ДвоичныеДанные);		
			Файл.Вставить("ТипФайла", ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(Строка.ТипФайла));
			
		КонецЕсли;
		
		МассивФайлов.Добавить(Файл);
		
	КонецЦикла;
	
	//Удаляем старые файлы
	//
	
	Для каждого ПутьКФайлу Из ФайлыДляУдаления Цикл
		Попытка
			УдалитьФайлы(ПутьКФайлу);
		Исключение
		КонецПопытки;
	КонецЦикла;	
	
	Возврат МассивФайлов;
	
КонецФункции

Функция ИмяКаталогаРесурса(Ресурс) Экспорт
	
	Если Ресурс = Справочники.РесурсыСУЗ.Общий Тогда
		Возврат "";
	ИначеЕсли Ресурс = Справочники.РесурсыСУЗ.Модули Тогда
		Возврат "plugins";
	Иначе
		Возврат Строка(Ресурс.УникальныйИдентификатор());	
	КонецЕсли;
	
КонецФункции

Функция АдресКаталогаРесурсов(ИдентификаторСводаЗнаний) Экспорт
	
	АдресКаталогаРесурсов = ОбъектыСУзПовтИсп.АдресКаталогаОбъектов()
	                       + "res_"
						   + ИдентификаторСводаЗнаний
						   + "/";
						   
	Возврат ОбщегоНазначенияСУКлиентСервер.ПривестиСлэши(АдресКаталогаРесурсов);
	
КонецФункции

// Возвращает единственный файл ресурса.
//
// Если в ресурсе нет файлов или их больше одного,
// Включая группы, то возвращаем Неопределено.
//
Функция ЕдинственныйФайлРесурса(Ресурс) Экспорт	 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 2
		|	ФайлыСУЗ.Ссылка
		|ИЗ
		|	Справочник.ФайлыСУЗ КАК ФайлыСУЗ
		|ГДЕ
		|	ФайлыСУЗ.ПометкаУдаления = ЛОЖЬ
		|	И ФайлыСУЗ.Владелец = &Ресурс";

	Запрос.УстановитьПараметр("Ресурс", Ресурс);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
		
		ВыборкаДетальныеЗаписи.Следующий();
		
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;	
	
	
КонецФункции

// SCORM

Процедура СформироватьТаблицуИспользованияПараметровSCORMВФоне(Параметры, АдресРезультата) Экспорт

	ТаблицаПараметровSCORM = ТаблицаИспользованияПараметровSCORM(Параметры.ЭлектронныйРесурс, Параметры.ЭлементСодержания, Параметры.ДатаЗагрузки);
	ПоместитьВоВременноеХранилище(ТаблицаПараметровSCORM, АдресРезультата);
	
КонецПроцедуры

Функция ТаблицаИспользованияПараметровSCORM(ЭлектронныйРесурс, ЭлементСодержания, ДатаЗагрузки) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
		ВызватьИсключение НСтр("ru = 'Электронный ресурс не задан'");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭлементСодержания) Тогда
		ВызватьИсключение НСтр("ru = 'Элемент содержания не задан'");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаЗагрузки) Тогда
		ВызватьИсключение НСтр("ru = 'Дата загрузки не задана'");
	КонецЕсли;
	
	ТаблицаСтатистикиПараметровSCORM = Перечисления.ИспользуемыеПараметрыSCORM.НоваяТаблицаСтатистикиПараметровSCORM();
	МаксимальноеЧислоСтатистики = 500;
	
	Выборка = Документы.ПопыткаВыполненияАктивногоРесурсаSCORM.Выбрать(ДатаЗагрузки,, Новый Структура("СводЗнаний", ЭлектронныйРесурс), "Дата Убыв");
		
	Пока Выборка.Следующий() Цикл
	
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.ДополнительныеСвойства.Вставить("ЭтоПолучениеСтатистикиSCORM", Истина);
		ДокументОбъект.СформироватьДвижения();
		
		Если ДокументОбъект.ЭлементСодержанияСводаЗнаний <> ЭлементСодержания 
			ИЛИ НЕ ДокументОбъект.Проведен
			ИЛИ ДокументОбъект.ТаблицаСтатистикиПараметровSCORM = Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;		
		
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДокументОбъект.ТаблицаСтатистикиПараметровSCORM, ТаблицаСтатистикиПараметровSCORM);
		
		Если ТаблицаСтатистикиПараметровSCORM.Количество() >= МаксимальноеЧислоСтатистики Тогда
			Прервать;
		КонецЕсли;	
		
	КонецЦикла;
		
	Выборка = Документы.СессияЭлектронногоРесурсаСУЗ.Выбрать(ДатаЗагрузки,, Новый Структура("ЭлектронныйРесурс", ЭлектронныйРесурс), "Дата Убыв");
		
	Пока Выборка.Следующий() Цикл
	
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.ДополнительныеСвойства.Вставить("ЭтоПолучениеСтатистикиSCORM", Истина);
		ДокументОбъект.СформироватьДвижения();
		
		Если НЕ ДокументОбъект.Проведен
			ИЛИ ДокументОбъект.ТаблицаСтатистикиПараметровSCORM = Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Для каждого СтрокаТС Из ДокументОбъект.ТаблицаСтатистикиПараметровSCORM Цикл
			Если СтрокаТС.ЭлементСодержания <> ЭлементСодержания Тогда
				Продолжить;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ТаблицаСтатистикиПараметровSCORM.Добавить(), СтрокаТС);
		КонецЦикла;
		
		Если ТаблицаСтатистикиПараметровSCORM.Количество() >= МаксимальноеЧислоСтатистики Тогда
			Прервать;
		КонецЕсли;	
		
	КонецЦикла;	
	
	Возврат ТаблицаСтатистикиПараметровSCORM;
	
КонецФункции

Функция ЗаписатьНастройкиSCORM(Ресурс, ТаблицаНастроек) Экспорт
	
	НаборЗаписей = РегистрыСведений.ЗначенияНастроекИнтерактивныхРесурсовСУЗ.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.СсылкаНаОбъектСУЗ.Установить(Ресурс);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.СсылкаНаОбъектСУЗ = Ресурс;
	НоваяЗапись.Значение = Новый ХранилищеЗначения(ТаблицаНастроек);
	НоваяЗапись.Представление = ОбщегоНазначенияСУ.ДанныеВJSON(ТаблицаНастроек);
	НоваяЗапись.ДатаИзменения = ТекущаяДатаСеанса();
	
	НаборЗаписей.Записать();	
	
КонецФункции

Функция УдалитьНастройкиSCORM(Ресурс) Экспорт
	
	НаборЗаписей = РегистрыСведений.ЗначенияНастроекИнтерактивныхРесурсовСУЗ.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.СсылкаНаОбъектСУЗ.Установить(Ресурс);
		
	НаборЗаписей.Записать();	
	
КонецФункции

Функция ПустаяСтруктураНастроек() Экспорт
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ТаблицаНастроек", НастройкиSCORMПоУмолчанию());
	СтруктураНастроек.Вставить("ЭтоНастройкиПоУмолчанию", Истина);
	Возврат СтруктураНастроек;
КонецФункции

Функция НастройкиПакетаSCORM(Ресурс) Экспорт
	
	СтруктураНастроек = ПустаяСтруктураНастроек();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияНастроекИнтерактивныхРесурсовСУЗ.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ЗначенияНастроекИнтерактивныхРесурсовСУЗ КАК ЗначенияНастроекИнтерактивныхРесурсовСУЗ
		|ГДЕ
		|	ЗначенияНастроекИнтерактивныхРесурсовСУЗ.СсылкаНаОбъектСУЗ = &СсылкаНаОбъектСУЗ";
	
	Запрос.УстановитьПараметр("СсылкаНаОбъектСУЗ", Ресурс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СтруктураНастроек;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	ВыборкаДетальныеЗаписи.Следующий();
	
	ПолученноеЗначение = ВыборкаДетальныеЗаписи.Значение.Получить();
	
	Если ТипЗнч(ПолученноеЗначение) <> Тип("ТаблицаЗначений") Тогда
		Возврат СтруктураНастроек;
	КонецЕсли;
	
	СтруктураНастроек.ТаблицаНастроек = ПолученноеЗначение;
	СтруктураНастроек.ЭтоНастройкиПоУмолчанию = Ложь;
	
	Возврат СтруктураНастроек;
	
КонецФункции

Функция НастройкиSCORMДляПолученияСтатистики() Экспорт

	СтруктураНастроек = ПустаяСтруктураНастроек();
	
	НастройкиSCORM = НастройкиSCORMПоУмолчанию();
	Для каждого СтрокаН Из НастройкиSCORM Цикл
		СтрокаН.Используется = Истина;
	КонецЦикла;
	
	СтруктураНастроек.ТаблицаНастроек = НастройкиSCORM;
	
	Возврат СтруктураНастроек;
	
КонецФункции	

Функция НастройкиSCORMПоУмолчанию() Экспорт
	
	ТаблицаНастроек = Новый ТаблицаЗначений;
	ТаблицаНастроек.Колонки.Добавить("Параметр");
	ТаблицаНастроек.Колонки.Добавить("Используется");
	ТаблицаНастроек.Колонки.Добавить("Комментарий");
	
	Для каждого ТекущейПараметр Из Перечисления.ИспользуемыеПараметрыSCORM Цикл
		
		ТекущаяНастройка = ТаблицаНастроек.Добавить();
		ТекущаяНастройка.Параметр = ТекущейПараметр;
		
		Если ТекущейПараметр = Перечисления.ИспользуемыеПараметрыSCORM.exit Тогда
			ТекущаяНастройка.Используется = Ложь;
		Иначе
			ТекущаяНастройка.Используется = Истина;
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат ТаблицаНастроек;
	
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура СформироватьXDTOФайлаРесурса(Ресурс, ВладелецXDTO, СтрокиДереваФайлов, ПараметрыСсылки, КонтекстВыполнения)
	
	Для каждого Строка Из СтрокиДереваФайлов Цикл
		
		Если Строка.Скрывать Тогда
			Продолжить;
		КонецЕсли;
		
		ФайлРесурса = Строка.Ссылка;
		
		ФайлXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Res", "Файл");
		ФайлXDTO     = ФабрикаXDTO.Создать(ФайлXDTOТип);
		
		ФайлXDTO.ЭтоГруппа     = Строка.ЭтоГруппа;
		ФайлXDTO.Наименование  = Строка.Наименование;
		
		Если Строка.ЭтоГруппа Тогда
			
			СформироватьXDTOФайлаРесурса(Ресурс, ФайлXDTO, Строка.Строки, ПараметрыСсылки, КонтекстВыполнения); // Рекурсия	
			
		Иначе
			
			СтруктураДанныхФайла = ОбъектыСУЗ.ПолучитьПредставление(ФайлРесурса, ПараметрыСсылки, КонтекстВыполнения);
			  
			ФайлXDTO.Представление = СтруктураДанныхФайла.Представление;
			ФайлXDTO.Скрипт        = СтруктураДанныхФайла.Скрипт;
			
		КонецЕсли;
		
		ВладелецXDTO.Файл.Добавить(ФайлXDTO);
	
	КонецЦикла;
	
КонецПроцедуры

Процедура КоличествоФайловРесурса(СтрокиДереваФайлов, КоличествоФайлов)
	
	Для каждого Строка Из СтрокиДереваФайлов Цикл
		
		Если Строка.Скрывать Тогда
			Продолжить;
		КонецЕсли;
		
		Если Строка.ЭтоГруппа Тогда
			
			КоличествоФайловРесурса(Строка.Строки, КоличествоФайлов); // Рекурсия	
			
		Иначе
			
			КоличествоФайлов = КоличествоФайлов + 1;
			
		КонецЕсли;
		
	
	КонецЦикла;
	
	
КонецПроцедуры

// Формирование файла page_scripts.js, который содержит персональные скрипты для данного ресурса
//
Функция ДвоичныеДанныеФайлаСкриптовAPIДляЗагруженныхФайлов(Ресурс, ЭлектронныйРесурс, УровеньВложенности, ПараметрыЭкспорта, Знач КонтекстВыполнения = Неопределено)
	
	ТекстСкрипта          = "";
	ПутьККаталогуРесурсов = ОбъектыСУЗКлиентСервер.ПолучитьПутьККаталогуРесурсовОтносительноФайла(УровеньВложенности);
	
	ТекстСкрипта = ТекстСкрипта + "document.write('<style>body {visibility: hidden;} table {max-width: 100% !important; width: auto !important;} img, video {max-width: 100% !important; height: auto !important;}</style>');" + Символы.ПС;
	
	// Запрет выделения (не используется)
	// ТекстСкрипта = ТекстСкрипта + "document.write('<style>*  { -webkit-touch-callout: none;  -webkit-user-select: none;   -khtml-user-select: none;     -moz-user-select: none;      -ms-user-select: none;        user-select: none;         }</style>');";
	
	// Подключаем скрипт для встроенного видео в двойных фигурных скобках по внешней ссылке
	
	Если КонтекстВыполнения = Неопределено Тогда
		КонтекстВыполнения = ОбъектыСУЗ.ЗаполнитьКонтекстВыполненияОбъекта(ЭлектронныйРесурс,,,,,,,,,,,Истина);
	КонецЕсли;		
	
	ШиринаВидеоПоУмолчанию = ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(РазработкаСУЗПовтИсп.ШиринаВидеоПоУмолчанию());	
	МожноПодключитьВидеоБезFlash = Справочники.ФайлыСУЗ.МожноОтключитьFlash(КонтекстВыполнения) 
		ИЛИ ПараметрыЭкспорта <> Неопределено;
	
	ТекстСкрипта = ТекстСкрипта + "$(document).ready(function() {" + Символы.ПС;	
	ТекстСкрипта = ТекстСкрипта + "$('a[href^=""javascript:""]').removeAttr(""target"");" + Символы.ПС;	
	ТекстСкрипта = ТекстСкрипта + "var pathToRes = '"+ПутьККаталогуРесурсов + "';" + Символы.ПС;
	ТекстСкрипта = ТекстСкрипта + "$(""body"").on(""contextmenu"", false);" + Символы.ПС;

	ТекстСкрипта = ТекстСкрипта + "
	|$(""a"").filter(function () {
	|	var textLink = $(this).text();
	|	if (typeof textLink == ""string"") {
	|		textLink = $.trim(textLink);
	|	} else {
	|		return;
	|	}
	|	var hrefLink = $(this).attr(""href"");
	|	if (textLink.substr(0, 2) === ""{{"" && textLink.substr(textLink.length - 2, 2) === ""}}"" && hrefLink.substr(0, 4) === ""http"") {	
	|		return true; 
	|	} else {
	|		return false;
	|	}
	|}).after(function(){
	|
	|function youtube_parser(url){
	|	var regExp = /^.*((youtu.be\/)|(v\/)|(\/u\/\w\/)|(embed\/)|(watch\?))\??v?=?([^#\&\?]*).*/;
	|	var match = url.match(regExp);
	|	return (match&&match[7].length==11)? match[7] : false;
	|}	
	|
	|var hrefLink = $(this).attr(""href"");
	|var youtubeURL = """";
	|var youtubeID = youtube_parser(hrefLink);
	|if (youtubeID) {
	|	var youtubeURL = ""https://www.youtube.com/embed/"" + youtubeID + ""?color=white&controls=1&iv_load_policy=3&rel=0&showinfo=0"";
	|	youtubeURL += ""&fs=0""; // OLD BROWSERS 		
	|}	
	|";	
	
	Если МожноПодключитьВидеоБезFlash Тогда
		ТекстСкрипта = ТекстСкрипта + "	
		|if (youtubeURL) {				
		|	return '<iframe type=\""text/html\"" width=\"""+ШиринаВидеоПоУмолчанию+"\"" height=\""480\"" src=\""'+youtubeURL+'\"" frameborder=\""0\"" allowfullscreen webkitallowfullscreen mozallowfullscreen></iframe>';
		|} else {
		|	return '<video controls=\""controls\"" controlsList=""nodownload"" width=\"""+ШиринаВидеоПоУмолчанию+"\"" src=\""'+$(this).attr(""href"")+'\""></video>';
		|}
		|";		
	Иначе	
		ТекстСкрипта = ТекстСкрипта + "	
		|if (youtubeURL) {				
		|	var textLink = $.trim($(this).text());
		|	textLink = textLink.substr(2, textLink.length-4)
		|	return '<a href=\""'+hrefLink+'\"" target=\""_blank\"">'+textLink+'</a>';
		|} else {
		|	return '<div><div id=\""'+$(this).attr(""href"")+'\"" class=\""externalVideo\"" path=\""'+ $(this).attr(""href"") +'\""><div class=\""file_Error\"">\n\t\t\t\t\t\t\t\tНевозможно отобразить объект Adobe Flash! <a xmlns:f=\""http://v8.1c.ru/kms/1/File\"" xmlns:ks=\""http://v8.1c.ru/kms/1/KnowledgeSources\"" href=\""http://get.adobe.com/flashplayer/\"">Установите Adobe Flash</a>\n</div></div></div>';
		|}
		|";
	КонецЕсли;
				
	ТекстСкрипта = ТекстСкрипта + "
	|}).remove();
	|";
	
	Если НЕ МожноПодключитьВидеоБезFlash Тогда
		
		ТекстСкрипта = ТекстСкрипта + "
		|if (typeof pathToRes !== ""undefined""){
		|	window.pathToRes = pathToRes;
		|}
		|$("".externalVideo"").each(function( index ) {
		|	var pathToRes = window.pathToRes;
		|	if (typeof pathToRes == ""undefined""){
		|		var pathToRes = """";
		|	}
		|	var pathPlayer = pathToRes + ""video.swf"";
		|	var flashvars = {};
		|	var attributes = {};
		|	var paramPlayer = ""fichier=""+$(this).attr(""id"");						
		|	var params = {quality: ""high"", allowscriptaccess:""always"", allowFullScreen: ""true"", swliveconnect:""true"", wmode:""opaque"", flashvars:paramPlayer};						
		|	swfobject.embedSWF(pathPlayer, $(this).attr(""id""), """+ШиринаВидеоПоУмолчанию+""", ""480"", ""9"", false, flashvars, params, attributes);
		|});
		|					
	    |
		|SWFFormFixAuto();				
		|";
		
	КонецЕсли;
	
	ТекстСкрипта = ТекстСкрипта + "});" + Символы.ПС;
	
	// Ищем ресурсы для подключения в API

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗависимыеРесурсыСУЗ.Ресурс КАК Ресурс
		|ИЗ
		|	Справочник.ЗависимыеРесурсыСУЗ КАК ЗависимыеРесурсыСУЗ
		|ГДЕ
		|	ЗависимыеРесурсыСУЗ.ДополняетAPI = ИСТИНА
		|	И ЗависимыеРесурсыСУЗ.Владелец = &Ресурс
		|	И ЗависимыеРесурсыСУЗ.ПометкаУдаления = ЛОЖЬ";

	Запрос.УстановитьПараметр("Ресурс", Ресурс);

	Результат = Запрос.Выполнить();

	Если НЕ Результат.Пустой() Тогда
			
		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		
		
		Если ПараметрыЭкспорта = Неопределено Тогда
			
			Если КонтекстВыполнения = Неопределено Тогда
				КонтекстВыполнения = ОбъектыСУЗ.ЗаполнитьКонтекстВыполненияОбъекта(ЭлектронныйРесурс,,,,,,,,,,,Истина);
			КонецЕсли;			
			
			СкриптРесурса = "";
			СкриптРесурса = СкриптРесурса + "$(document).ready(function() {" + Символы.ПС;

			СкриптРесурса = СкриптРесурса + "var pathToRes = '"+ПутьККаталогуРесурсов + "';" + Символы.ПС;
			СкриптРесурса = СкриптРесурса + "$.fn.media.defaults.flvPlayer = '"+ПутьККаталогуРесурсов+"mediaplayer.swf';" + Символы.ПС;
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				АдресРесурса       = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(ВыборкаДетальныеЗаписи.Ресурс);
				ПараметрыСсылки    = ОбъектыСУЗКлиентСервер.СтруктураСтрокиПараметров(АдресРесурса);
				
				СкриптРесурса = СкриптРесурса + "if (jQuery.browser.msie) {" + Символы.ПС;								
				ПредставлениеРесурса = ОбъектыСУЗ.ПолучитьПредставление(ВыборкаДетальныеЗаписи.Ресурс, ПараметрыСсылки, КонтекстВыполнения);
				СкриптРесурса = СкриптРесурса + "$('a[id^=""res_"+СтрЗаменить(Строка(ВыборкаДетальныеЗаписи.Ресурс.УникальныйИдентификатор()), "-", "")+"""]').after('"+ОбщегоНазначенияСУКлиентСервер.JSСтрока(ПредставлениеРесурса.Представление)+"').remove();" + Символы.ПС;
				
				СкриптРесурса = СкриптРесурса + "} else {" + Символы.ПС;								
				ПредставлениеРесурса = ОбъектыСУЗ.ПолучитьПредставление(ВыборкаДетальныеЗаписи.Ресурс, ПараметрыСсылки, КонтекстВыполнения);
				СкриптРесурса = СкриптРесурса + "$('a[id^=""res_"+СтрЗаменить(Строка(ВыборкаДетальныеЗаписи.Ресурс.УникальныйИдентификатор()), "-", "")+"""]').after('"+ОбщегоНазначенияСУКлиентСервер.JSСтрока(ПредставлениеРесурса.Представление)+"').remove();" + Символы.ПС;				
				
				СкриптРесурса = СкриптРесурса + "};" + Символы.ПС;
				
				СкриптРесурса = СкриптРесурса + ПредставлениеРесурса.Скрипт + Символы.ПС;
				
			КонецЦикла;
			
			
			СкриптРесурса = СкриптРесурса + "});" + Символы.ПС;
			
			ТекстСкрипта = ТекстСкрипта + СкриптРесурса;
			
		Иначе
			
			
			ОписаниеРесурсовJS = "var mediaFiles = [";
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				ЗапросФайлов = Новый Запрос;
				ЗапросФайлов.Текст = 
					"ВЫБРАТЬ
					|	ФайлыСУЗ.Ссылка КАК Файл,
					|	ФайлыСУЗ.Высота,
					|	ФайлыСУЗ.Ширина,
					|	ФайлыСУЗ.ПроигрыватьАвтоматически,
					|	ФайлыСУЗ.ТипФайла,
					|	ФайлыСУЗ.ОткрыватьПоСсылке,
					|	ФайлыСУЗ.Наименование,
					|	ВЫБОР
					|		КОГДА ДанныеФайлыСУЗ.КодДанных ЕСТЬ NULL
					|			ТОГДА ЛОЖЬ
					|		ИНАЧЕ ИСТИНА
					|	КОНЕЦ КАК ЕстьМиниатюра,
					|	ФайлыСУЗ.ИмяФайла
					|ИЗ
					|	Справочник.ФайлыСУЗ КАК ФайлыСУЗ
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеФайлыСУЗ КАК ДанныеФайлыСУЗ
					|		ПО (ДанныеФайлыСУЗ.СсылкаНаОбъектСУЗ = ФайлыСУЗ.Ссылка)
					|			И (ДанныеФайлыСУЗ.Поставщик = ФайлыСУЗ.Поставщик)
					|			И (ДанныеФайлыСУЗ.Версия = ФайлыСУЗ.Версия)
					|			И (ДанныеФайлыСУЗ.КодДанных = &КодДанных)
					|ГДЕ
					|	ФайлыСУЗ.Владелец = &Ресурс
					|	И ФайлыСУЗ.ТипФайла В(&ТипыФайлов)
					|	И ФайлыСУЗ.ПометкаУдаления = ЛОЖЬ
					|	И ФайлыСУЗ.ЭтоГруппа = ЛОЖЬ";
				
				ЗапросФайлов.УстановитьПараметр("Ресурс", ВыборкаДетальныеЗаписи.Ресурс);
				ЗапросФайлов.УстановитьПараметр("КодДанных", "Миниатюра");
				
				ТипыФайлов = Новый Массив;
				ТипыФайлов.Добавить(Перечисления.ТипыФайловСУЗ.Video);
				ТипыФайлов.Добавить(Перечисления.ТипыФайловСУЗ.Audio);
				
				ЗапросФайлов.УстановитьПараметр("ТипыФайлов", ТипыФайлов);
				
				РезультатЗапросаФайлов = ЗапросФайлов.Выполнить();
				
				ВыборкаФайлов = РезультатЗапросаФайлов.Выбрать();
				
				Если ВыборкаФайлов.Количество() = 1 Тогда
				
					ВыборкаФайлов.Следующий();
					
					ПутьКФайлу = ПутьККаталогуРесурсов + Справочники.ФайлыСУЗ.ПолучитьОтносительныйПутьКФайлу(ВыборкаФайлов.Файл, ПараметрыЭкспорта);
					
					ПутьКМиниатюре = "";
					
					Если ВыборкаФайлов.ЕстьМиниатюра Тогда
						ПутьКМиниатюре = Справочники.ФайлыСУЗ.ИмяФайлаМиниатюры(ПутьКФайлу);
					КонецЕсли;
					
					ОписаниеРесурсовJS = ОписаниеРесурсовJS + "{
					|	idRes: """+Строка(ВыборкаДетальныеЗаписи.Ресурс.УникальныйИдентификатор())+""",
					|	id: """+Строка(ВыборкаФайлов.Файл.УникальныйИдентификатор())+""",
					|	path: """+ПутьКФайлу+""",
					|	height : """ + ОбщегоНазначенияСУКлиентСервер.JSСтрока(ВыборкаФайлов.Высота) + """,
					|	width : """ + ОбщегоНазначенияСУКлиентСервер.JSСтрока(ВыборкаФайлов.Ширина) + """,
					|	autoPlay : "+ОбщегоНазначенияСУКлиентСервер.БулевоВJSСтроку(ВыборкаФайлов.ПроигрыватьАвтоматически)+",
					|	type : """+ ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(ВыборкаФайлов.ТипФайла) +""",
					|	name : """+ ОбщегоНазначенияСУКлиентСервер.JSСтрока(ВыборкаФайлов.Наименование) +""",
					|	asLink : "+ ОбщегоНазначенияСУКлиентСервер.БулевоВJSСтроку(ВыборкаФайлов.ОткрыватьПоСсылке) +",
					|   poster : """ + ПутьКМиниатюре + """
					|},";
					
				КонецЕсли;
					
			КонецЦикла;

			ОписаниеРесурсовJS = Лев(ОписаниеРесурсовJS, СтрДлина(ОписаниеРесурсовJS) - 1); // Убираем последнюю запятую
			
			ОписаниеРесурсовJS = ОписаниеРесурсовJS + "];";
			
			
			ТекстСкрипта = ТекстСкрипта + ОписаниеРесурсовJS;
			
		КонецЕсли;
			
	КонецЕсли;
	
	
	ПутьКВременномуФайлу = ПолучитьИмяВременногоФайла("js");
	
	ТекстовыйДокументСкрипта = Новый ТекстовыйДокумент;
	ТекстовыйДокументСкрипта.УстановитьТекст(ТекстСкрипта);
	
	ТекстовыйДокументСкрипта.Записать(ПутьКВременномуФайлу);
	
	ДвоичныеДанныеСкрипта = Новый ДвоичныеДанные(ПутьКВременномуФайлу);
	
	Удалитьфайлы(ПутьКВременномуФайлу);
	
	Возврат ДвоичныеДанныеСкрипта;
	
КонецФункции

Функция ЭлементHTMLЯвляетсяСсылкой(ЭлементDOM)
	
	Если НРег(ЭлементDOM.ИмяУзла) = "a" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ЭлементDOM.РодительскийУзел <> Неопределено Тогда
		Возврат ЭлементHTMLЯвляетсяСсылкой(ЭлементDOM.РодительскийУзел); // Рекурсия
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура ПодготовитьДеревоФайловДляПубликации(СтрокиДереваФайлов, ПараметрыЭкспорта)
	
	Для каждого Строка Из СтрокиДереваФайлов Цикл
		
		Если Строка.ВнешнийФайл = NULL ИЛИ НЕ Строка.ВнешнийФайл Тогда
			Строка.ИмяФайла = Справочники.ФайлыСУЗ.ИмяФайлаДляВыгрузки(Строка.Ссылка, Строка.ИмяФайла, Строка.ТипФайла, ПараметрыЭкспорта);
		КонецЕсли;		
			
		Если Строка.Строки.Количество() > 0 Тогда
			ПодготовитьДеревоФайловДляПубликации(Строка.Строки, ПараметрыЭкспорта);
		КонецЕсли;		
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти	


#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
				
		Ключ = Неопределено;
		ОткрытьФормуФайла = Неопределено;
		ОткрытьФормуДокумента = Неопределено;
		ОткрытьФормуРесурса = Неопределено;
		
		Параметры.Свойство("Ключ", Ключ);
		Параметры.Свойство("ОткрытьФормуФайла", ОткрытьФормуФайла);
		Параметры.Свойство("ОткрытьФормуДокумента", ОткрытьФормуДокумента);
		Параметры.Свойство("ОткрытьФормуРесурса", ОткрытьФормуРесурса);
		
		Если ОткрытьФормуРесурса = ИСТИНА Тогда
			Возврат; // Открываем по умолчанию
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ключ) Тогда
			
			ЭтоSCO = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ключ, "SCO");
			
			Если ЭтоSCO Тогда
				СтандартнаяОбработка = Ложь;
				ВыбраннаяФорма = "Справочник.РесурсыСУЗ.Форма.ФормаЭлементаSCORM";
				Возврат;
			КонецЕсли;
		
		КонецЕсли;
		
		Если ОткрытьФормуФайла = ИСТИНА ИЛИ ОткрытьФормуДокумента = ИСТИНА Тогда
		
			Если ЗначениеЗаполнено(Ключ) Тогда				
								
				ЕдинственныйФайл = ЕдинственныйФайлРесурса(Ключ);
				
				Если ЗначениеЗаполнено(ЕдинственныйФайл) Тогда
					
					ТипЕдинственногоФайла = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЕдинственныйФайл, "ТипФайла");
					
					СтандартнаяОбработка = Ложь;
					Параметры.Ключ = ЕдинственныйФайл;
					
					ВыбраннаяФорма = ?(ОткрытьФормуДокумента = ИСТИНА
						ИЛИ ТипЕдинственногоФайла = Перечисления.ТипыФайловСУЗ.Document,
					"Справочник.ФайлыСУЗ.Форма.ФормаДокумента", "Справочник.ФайлыСУЗ.ФормаОбъекта");
					Возврат;
					
				КонецЕсли;					
							
			Иначе
				
				СтандартнаяОбработка = Ложь;
				ВыбраннаяФорма = ?(ОткрытьФормуДокумента = ИСТИНА, "Справочник.ФайлыСУЗ.Форма.ФормаДокумента", "Справочник.ФайлыСУЗ.ФормаОбъекта");				
				Возврат;
				
			КонецЕсли;			
			
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли
